#include <stdio.h>

//Multidimentional Array
void MultidimentionalArray() {
	int i; // ¡à

	int arr1[5]; // ¡à¡à¡à¡à¡à

	int arr2[2][5];
	// ¡à¡à¡à¡à¡à
	// ¡à¡à¡à¡à¡à

	int arr3[4][2];
	// ¡à¡à
	// ¡à¡à
	// ¡à¡à
	// ¡à¡à

	int arr4[3][3][3];
	// ¡à¡à¡à
	// ¡à¡à¡à
	// ¡à¡à¡à

	// ¡à¡à¡à
	// ¡à¡à¡à
	// ¡à¡à¡à

	// ¡à¡à¡à
	// ¡à¡à¡à
	// ¡à¡à¡à
}

void AccessMDA() {
	int arr2[2][5];
	// [0,0][0,1][0,2][0,3][0,4] -> arr2[0][0]
	// [1,0][1,1][1,2][1,3][1,4] -> arr2[1][0]

	int x = arr2[0][3];
	int y = arr2[1][2];
}

void DeclareMDA() {
	int arr[5] = { 1, 2, 3, 4, 5 };
	
	int arr2[2][5] = {
		{1,2,3,4,5},
		{1,2,3,4,5} 
	};
	
	int arr3[4][2] = { 
		{1,2},
		{1,2},
		{1,2},
		{1,2} 
	};

	int arr4[3][3][3] = { 
		{
			{1,2,3},
			{1,2,3},
			{1,2,3},
		},
		{
			{1,2,3},
			{1,2,3},
			{1,2,3}
		},
		{
			{1,2,3},
			{1,2,3},
			{1,2,3}
		}
	};
}